{
  "basic": {
    "name": "Matt Presson",
    "email": "mpresson333@icloud.com",
    "linkedin": "https://www.linkedin.com/in/matt-presson/",
    "resume": "resume.pdf"
  },
  "home": {
    "heroSentence": "design and engineering with fun at the helm",
    "projects": [
      {
        "name": "Trainyard",
        "year": "2024",
        "keywords": ["Unity", "Education", "Puzzle Game"],
        "shortDesc": "Trainyard is an educational puzzle game for elementary and middle school students in which players edit and connect coding blocks to program instructions for train movements. It was developed as a capstone project for NC State Computer Science in collaboration with Katabasis and my teammates Alex Sawdy, Jace Glover, Samantha Collins, and Jackson Westbrook.",
        "coverImage": "/projects/trainyard/trainyard.jpg",
        "roles": ["Level Design", "Level Implementation"],
        "highlights": [
          "Experience conducting playtests, unit tests, and acceptance tests",
          "Scrum software engineering experience",
          "Level design and implementation"
        ],
        "detail": [
          {
            "type": "paragraph",
            "value": "This game was made for my senior design project with NC State Computer Science, and as such we treated it like a contract-based project. Each group had an industry sponsor to work for, and my group worked with Katabasis, a 501(c)(3) organization in the Triangle that creates educational computer science games. Following a Scrum methodology, my team and I conducted 2-3 week sprints to create a paper prototype, create a Unity protoype, build levels and UI, and finally expand and polish. I worked as our lead of level design and quality assurance, creating design templates, blueprints, and level builds towards the beginning, and conducting playtests and acceptance tests towards the end. My main takeaway from this project was a wholesale software engineering project experience, from identifying requirements and constraints to creating multi-level design graphics to writing unit tests, all within the context of game design and development. While I learned a lot about the Unity engine and game engineering practices, I learned more about how to formalize development, set goals, and communicate responsibilities with teammates."
          },
          {
            "value": "/projects/trainyard/level.png",
            "type": "image"
          },
          {
            "value": "/projects/trainyard/poster.png",
            "type": "image"
          },
          {
            "value": "/projects/trainyard/design.png",
            "type": "image"
          }
          // {
          //   "value": "/projects/cleo/7.mp4",
          //   "type": "video-muted"
          // }
        ]
      }
    ],
    "skills": [
      {
        "group": "Technical Skills",
        "skills": [
          "Programming Languages: C/C++, Python, JavaScript",
          "Game Engines: Unreal Engine 5, Unity",
          "Tools/Frameworks: Git, J-UNIT, REST"
        ]
      },
      {
        "group": "Creative Skills",
        "skills": [
          "Prototyping: Playdate, Pygame, Godot",
          "Graphics/Shader Programming: GLSL, WebGL",
          "Level Design: Unreal Engine Level Editor, Unity Terrain"
        ]
      },
      {
        "group": "Soft Skills",
        "skills": [
          "Team Collaboration: Leadership Experience, Software Project Management",
          "Problem Solving: Analytical Thinking, Debugging",
          "Communication: Documentation, Presentation Skills"
        ]
      }
    ],
    "bio": "Dedicated and passionate senior pursuing a Master’s degree in Game Development. Seeking an internship or entry-level position that offers the opportunity to apply strong programming, problem-solving, and creative design skills in a professional environment. Eager to contribute to innovative projects while continuing to learn and grow in areas such as shader programming, enemy behavior trees, and UX/UI scripting.",
    "bioPic": "profile_pic.jpg"
  }
}
